; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=180, out_folder=./training, instance_id=6, seed=2030, goal_proportion=0.03

(define (problem blocksworld-06)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 - object)
 (:init 
    (arm-empty)
    (clear b65)
    (on b65 b157)
    (on-table b157)
    (clear b41)
    (on b41 b104)
    (on b104 b48)
    (on-table b48)
    (clear b178)
    (on b178 b38)
    (on-table b38)
    (clear b6)
    (on b6 b144)
    (on-table b144)
    (clear b122)
    (on b122 b39)
    (on b39 b143)
    (on b143 b135)
    (on b135 b148)
    (on b148 b20)
    (on b20 b46)
    (on b46 b113)
    (on-table b113)
    (clear b128)
    (on b128 b87)
    (on b87 b13)
    (on b13 b107)
    (on-table b107)
    (clear b19)
    (on-table b19)
    (clear b145)
    (on b145 b61)
    (on b61 b164)
    (on b164 b179)
    (on-table b179)
    (clear b166)
    (on b166 b71)
    (on b71 b100)
    (on b100 b86)
    (on b86 b141)
    (on-table b141)
    (clear b79)
    (on b79 b176)
    (on-table b176)
    (clear b180)
    (on b180 b126)
    (on b126 b168)
    (on b168 b93)
    (on b93 b171)
    (on b171 b64)
    (on-table b64)
    (clear b167)
    (on b167 b11)
    (on b11 b67)
    (on-table b67)
    (clear b114)
    (on b114 b33)
    (on-table b33)
    (clear b72)
    (on b72 b123)
    (on b123 b37)
    (on b37 b60)
    (on b60 b17)
    (on-table b17)
    (clear b95)
    (on b95 b4)
    (on b4 b18)
    (on b18 b154)
    (on b154 b76)
    (on b76 b116)
    (on b116 b12)
    (on b12 b32)
    (on-table b32)
    (clear b111)
    (on-table b111)
    (clear b43)
    (on b43 b162)
    (on b162 b91)
    (on b91 b44)
    (on b44 b115)
    (on b115 b66)
    (on b66 b106)
    (on b106 b57)
    (on b57 b83)
    (on b83 b110)
    (on b110 b174)
    (on-table b174)
    (clear b73)
    (on b73 b63)
    (on b63 b159)
    (on-table b159)
    (clear b42)
    (on b42 b58)
    (on b58 b16)
    (on b16 b139)
    (on b139 b55)
    (on-table b55)
    (clear b68)
    (on-table b68)
    (clear b103)
    (on-table b103)
    (clear b94)
    (on b94 b151)
    (on b151 b117)
    (on b117 b153)
    (on b153 b124)
    (on-table b124)
    (clear b45)
    (on-table b45)
    (clear b53)
    (on b53 b81)
    (on b81 b175)
    (on b175 b49)
    (on-table b49)
    (clear b163)
    (on b163 b136)
    (on-table b136)
    (clear b177)
    (on b177 b26)
    (on b26 b36)
    (on b36 b47)
    (on-table b47)
    (clear b102)
    (on b102 b169)
    (on-table b169)
    (clear b2)
    (on-table b2)
    (clear b3)
    (on b3 b52)
    (on b52 b89)
    (on-table b89)
    (clear b105)
    (on b105 b80)
    (on-table b80)
    (clear b62)
    (on b62 b161)
    (on b161 b130)
    (on b130 b8)
    (on b8 b5)
    (on b5 b165)
    (on b165 b14)
    (on b14 b21)
    (on-table b21)
    (clear b119)
    (on-table b119)
    (clear b9)
    (on-table b9)
    (clear b75)
    (on b75 b142)
    (on-table b142)
    (clear b160)
    (on b160 b85)
    (on-table b85)
    (clear b150)
    (on-table b150)
    (clear b7)
    (on-table b7)
    (clear b131)
    (on-table b131)
    (clear b173)
    (on b173 b25)
    (on b25 b30)
    (on b30 b28)
    (on-table b28)
    (clear b22)
    (on-table b22)
    (clear b23)
    (on b23 b108)
    (on-table b108)
    (clear b10)
    (on b10 b92)
    (on-table b92)
    (clear b155)
    (on b155 b29)
    (on b29 b152)
    (on b152 b51)
    (on-table b51)
    (clear b125)
    (on b125 b88)
    (on b88 b50)
    (on b50 b35)
    (on b35 b82)
    (on b82 b146)
    (on b146 b69)
    (on b69 b31)
    (on b31 b84)
    (on b84 b78)
    (on b78 b137)
    (on b137 b138)
    (on b138 b147)
    (on b147 b127)
    (on b127 b54)
    (on b54 b27)
    (on b27 b70)
    (on b70 b101)
    (on b101 b158)
    (on b158 b40)
    (on b40 b97)
    (on-table b97)
    (clear b170)
    (on b170 b140)
    (on b140 b134)
    (on-table b134)
    (clear b59)
    (on-table b59)
    (clear b90)
    (on b90 b172)
    (on b172 b132)
    (on b132 b120)
    (on b120 b56)
    (on-table b56)
    (clear b133)
    (on b133 b15)
    (on b15 b109)
    (on-table b109)
    (clear b149)
    (on b149 b24)
    (on b24 b77)
    (on b77 b156)
    (on b156 b34)
    (on b34 b98)
    (on-table b98)
    (clear b112)
    (on-table b112)
    (clear b118)
    (on b118 b121)
    (on-table b121)
    (clear b1)
    (on-table b1)
    (clear b129)
    (on b129 b96)
    (on b96 b99)
    (on-table b99)
    (clear b74)
    (on-table b74))
 (:goal  (and 
    (clear b4)
    (on-table b4)
    (clear b2)
    (on b2 b1)
    (on b1 b3)
    (on b3 b5)
    (on-table b5))))

; plan
1. (unstack b62 b161)
   deleted: (on b62 b161) (clear b62) (arm-empty)
   added: (holding b62) (clear b161)
   goals met: 1 of 7
2. (putdown b62)
   deleted: (holding b62)
   added: (clear b62) (arm-empty) (on-table b62)
   goals met: 1 of 7
3. (unstack b161 b130)
   deleted: (on b161 b130) (clear b161) (arm-empty)
   added: (holding b161) (clear b130)
   goals met: 1 of 7
4. (putdown b161)
   deleted: (holding b161)
   added: (clear b161) (arm-empty) (on-table b161)
   goals met: 1 of 7
5. (unstack b130 b8)
   deleted: (on b130 b8) (clear b130) (arm-empty)
   added: (holding b130) (clear b8)
   goals met: 1 of 7
6. (putdown b130)
   deleted: (holding b130)
   added: (clear b130) (arm-empty) (on-table b130)
   goals met: 1 of 7
7. (unstack b8 b5)
   deleted: (on b8 b5) (clear b8) (arm-empty)
   added: (holding b8) (clear b5)
   goals met: 1 of 7
8. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 1 of 7
9. (unstack b5 b165)
   deleted: (on b5 b165) (clear b5) (arm-empty)
   added: (holding b5) (clear b165)
   goals met: 1 of 7
10. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 2 of 7
11. (unstack b95 b4)
   deleted: (on b95 b4) (clear b95) (arm-empty)
   added: (holding b95) (clear b4)
   goals met: 3 of 7
12. (putdown b95)
   deleted: (holding b95)
   added: (clear b95) (arm-empty) (on-table b95)
   goals met: 3 of 7
13. (unstack b4 b18)
   deleted: (on b4 b18) (clear b4) (arm-empty)
   added: (holding b4) (clear b18)
   goals met: 2 of 7
14. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 4 of 7
15. (unstack b3 b52)
   deleted: (on b3 b52) (clear b3) (arm-empty)
   added: (holding b3) (clear b52)
   goals met: 4 of 7
16. (stack b3 b5)
   deleted: (clear b5) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b5)
   goals met: 5 of 7
17. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 5 of 7
18. (stack b1 b3)
   deleted: (clear b3) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b3)
   goals met: 6 of 7
19. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 5 of 7
20. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 7 of 7
